apache/nuttx/arch/arm/src/gd32f4/gd32f4xx_progmem.c
/****************************************************************************
 * arch/arm/src/gd32f4/gd32f4xx_progmem.c
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <errno.h>
#include <stdint.h>
#include <stdbool.h>
#include <limits.h>

#include <arch/chip/chip.h>
#include <arch/board/board.h>
#include <nuttx/arch.h>
#include <nuttx/progmem.h>
#include <nuttx/irq.h>
#include <nuttx/mutex.h>

#include "gd32f4xx_progmem.h"
#include "gd32f4xx_fmc.h"
#include "gd32f4xx.h"

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* Progmem helpers used around FMC program/erase must not fetch from the
 * same flash bank while FMC is busy. Match gd32f4xx_fmc.c RAMFUNC style.
 */

#ifdef CONFIG_ARCH_RAMFUNCS
#  ifdef __clang__
#    define PROGMEM_RAMFUNC __ramfunc__
#  else
#    define PROGMEM_RAMFUNC locate_code(".ramfunc") farcall_function noinline_function
#  endif
#else
#  define PROGMEM_RAMFUNC
#endif

#if defined(CONFIG_GD32F4_FLASH_CONFIG_DEFAULT)

#  define FMC_PROGMEM_SECTOR_SIZES       {_K(128), _K(128)}
#  define FMC_PROGMEM_SECTOR_NUM         (2)
#  define FMC_PROGMEM_PAGESIZE         4096
#  define FMC_PROGMEM_SECTOR_SADDR       (0x08040000)
#  define FMC_PROGMEM_SECTOR_EADDR       (0x0807FFFF)

#elif !defined(CONFIG_GD32F4_FLASH_CONFIG_DEFAULT)

#  if defined(CONFIG_GD32F4_FLASH_CONFIG_E)

#    define FMC_PROGMEM_SECTOR_SIZES     {_K(128), _K(128)}
#    define FMC_PROGMEM_SECTOR_NUM       (2)
#    define FMC_PROGMEM_SECTOR_SADDR     (0x08040000)
#    define FMC_PROGMEM_SECTOR_EADDR     (0x0807FFFF)
#    define FMC_PROGMEM_PAGESIZE         4096

#  elif defined(CONFIG_GD32F4_FLASH_CONFIG_G)

#    define FMC_PROGMEM_SECTOR_SIZES     {_K(128), _K(128)}
#    define FMC_PROGMEM_SECTOR_NUM       (2)
#    define FMC_PROGMEM_SECTOR_SADDR     (0x080C0000)
#    define FMC_PROGMEM_SECTOR_EADDR     (0x080FFFFF)

#  elif defined(CONFIG_GD32F4_FLASH_CONFIG_I)
#    if defined(CONFIG_GD32F4_GD32F470)
/* GD32F470xI: 2048 KiB @ 0x08000000. Expose uniform 4 KiB blocks to MTD
 * (partition math needs uniform pagesize). Hardware erase uses sector erase
 * inside up_progmem_eraseblock() — page-erase BUSY can stick forever when the
 * loader overwrites primary in the same flash bank.
 */

#      define FMC_PROGMEM_SECTOR_SIZES   {_K(256), _K(256), _K(256), _K(256)}
#      define FMC_PROGMEM_SECTOR_NUM     (512)
#      define FMC_PROGMEM_SECTOR_SADDR   (0x08000000)
#      define FMC_PROGMEM_SECTOR_EADDR   (0x081FFFFF)
#      define FMC_PROGMEM_PAGESIZE       4096
#      define FMC_PROGMEM_USE_HW_SECTOR_ERASE 1
#    else
#      define FMC_PROGMEM_SECTOR_SIZES   {_K(16), _K(16), _K(16), _K(16)}
#      define FMC_PROGMEM_SECTOR_NUM     (4)
#      define FMC_PROGMEM_SECTOR_SADDR   (0x08100000)
#      define FMC_PROGMEM_SECTOR_EADDR   (0x0810FFFF)
#    endif

#  elif defined(CONFIG_GD32F4_FLASH_CONFIG_K)
#if defined(CONFIG_GD32F4_GD32F450)
#    define FMC_PROGMEM_SECTOR_SIZES     {_K(16), _K(16), _K(16), _K(16)}
#    define FMC_PROGMEM_SECTOR_NUM       (4)
#    define FMC_PROGMEM_SECTOR_SADDR     (0x08100000)
#    define FMC_PROGMEM_SECTOR_EADDR     (0x0810FFFF)
#elif defined(CONFIG_GD32F4_GD32F470)
#    define FMC_PROGMEM_SECTOR_SIZES     {_K(256), _K(256), _K(256), _K(256)}
#    define FMC_PROGMEM_SECTOR_NUM       (256)
#    define FMC_PROGMEM_SECTOR_SADDR     (0x08200000)
#    define FMC_PROGMEM_SECTOR_EADDR     (0x082FFFFF)
#    define FMC_PROGMEM_PAGESIZE         4096
#endif

#  endif

#endif /* !defined(CONFIG_GD32F4_FLASH_CONFIG_DEFAULT) */

/* Sector size */

#define SIZE_16KB                  (0x00004000)                    /* size of 16KB*/
#define SIZE_64KB                  (0x00010000)                    /* size of 64KB*/
#define SIZE_128KB                 (0x00020000)                    /* size of 128KB*/
#define SIZE_256KB                 (0x00040000)                    /* size of 256KB*/

/* FMC BANK address */

#define FMC_START_ADDRESS          (0x08000000)                    /* FMC start address */
#define FMC_BANK0_START_ADDRESS    FMC_START_ADDRESS               /* FMC BANK0 start address */
#define FMC_BANK1_START_ADDRESS    (0x08100000)                    /* FMC BANK1 start address */
#define FMC_SIZE                   (*(uint16_t *)0x1FFF7A22)       /* FMC SIZE */
#define FMC_END_ADDRESS            (FMC_START_ADDRESS + (FMC_SIZE * 1024) - 1)
                                                                   /* FMC end address */
#define FMC_MAX_END_ADDRESS        (0x08300000)                    /* FMC maximum end address */

/* FMC error message */

#define FMC_WRONG_SECTOR_NAME      (0xFFFFFFFF)                    /* wrong sector name*/
#define FMC_WRONG_SECTOR_NUM       (0xFFFFFFFF)                    /* wrong sector number*/
#define FMC_INVALID_SIZE           (0xFFFFFFFF)                    /* invalid sector size*/
#define FMC_INVALID_ADDR           (0xFFFFFFFF)                    /* invalid sector address*/

