apache/nuttx/arch/arm/src/gd32f4/gd32f4xx_progmem.c
  addr -= FMC_PROGMEM_SECTOR_SADDR;

  for (i = 0; i < FMC_PROGMEM_SECTOR_NUM; ++i)
    {
      page += up_progmem_pagesize(i);
      if (page > addr)
        {
          return i;
        }
    }

  return -EFAULT;
}

/****************************************************************************
 * Name: up_progmem_getaddress
 *
 * Description:
 *   Read/write page to address conversion
 *
 * Input Parameters:
 *   page - page index
 *
 * Returned Value:
 *   Base address of given page, SIZE_MAX if page index is not valid.
 *
 ****************************************************************************/

size_t up_progmem_getaddress(size_t page)
{
  size_t addr = FMC_PROGMEM_SECTOR_SADDR;
  size_t i;

  if (page >= FMC_PROGMEM_SECTOR_NUM)
    {
      return SIZE_MAX;
    }

  for (i = 0; i < page; ++i)
    {
      addr += up_progmem_pagesize(i);
    }

  return addr;
}

/****************************************************************************
 * Name: up_progmem_eraseblock
 *
 * Description:
 *   Erase selected block.
 *
 * Input Parameters:
 *   block - The erase block index to be erased.
 *
 * Returned Value:
 *   block size or negative value on error.  The following errors are
 *   reported (errno is not set!):
 *
 *     -EFAULT: On invalid page
 *     -EIO:    On unsuccessful erase
 *     -EROFS:  On access to write protected area
 *     -EACCES: Insufficient permissions (read/write protected)
 *     -EPERM:  If operation is not permitted due to some other constraints
 *              (i.e. some internal block is not running etc.)
 *
 ****************************************************************************/

/* Spot-check first / mid / last word of a 4 KiB page (RAM-safe). */

static PROGMEM_RAMFUNC bool progmem_page_erased_spot(size_t addr)
{
  if (*(volatile uint32_t *)(addr) != 0xffffffffu)
    {
      return false;
    }

  if (*(volatile uint32_t *)(addr + 2048u) != 0xffffffffu)
    {
      return false;
    }

  if (*(volatile uint32_t *)(addr + 4092u) != 0xffffffffu)
    {
      return false;
    }

  return true;
}

ssize_t PROGMEM_RAMFUNC up_progmem_eraseblock(size_t block)
{
  size_t addr;
#ifndef FMC_PROGMEM_USE_HW_SECTOR_ERASE
  fmc_sector_info_struct sector_info;
#endif

  if (block >= FMC_PROGMEM_SECTOR_NUM)
    {
      return -EFAULT;
    }

  /* Inline address math — do not call Flash-resident up_progmem_getaddress
   * or gd32_fmc_sector_info_get from this .ramfunc path.
   */

#ifdef FMC_PROGMEM_PAGESIZE
  addr = FMC_PROGMEM_SECTOR_SADDR + block * FMC_PROGMEM_PAGESIZE;
#else
  addr = up_progmem_getaddress(block);
#endif

#if defined(CONFIG_GD32F4_GD32F470) || defined(FMC_PROGMEM_USE_HW_SECTOR_ERASE)
  /* GD32F470: 4 KiB page erase. Sector erase from on-chip loader has been
   * observed to leave FMC BUSY stuck. Erasing an already-blank page can also
   * stick — skip FMC when the logical page is already 0xFF (word scan).
   */

  /* FMC must be idle before touching flash. If a prior operation left BUSY
   * set, any flash read stalls the AHB bus forever (observed hang in
   * up_progmem_ispageerased). Fail fast instead of deadlocking so the caller
   * can abort the upgrade cleanly.
   */

  if ((getreg32(GD32_FMC_STAT) & FMC_STAT_BUSY) != 0)
    {
      return -EBUSY;
    }

  if (up_progmem_ispageerased(block) == 0)
    {
      return (ssize_t)FMC_PROGMEM_PAGESIZE;
    }

  gd32_fmc_unlock_ram();
  gd32_fmc_flag_clear_ram(FMC_STAT_END | FMC_STAT_OPERR | FMC_STAT_WPERR |
                          FMC_STAT_PGMERR | FMC_STAT_PGSERR | FMC_STAT_RDDERR);

  if (gd32_fmc_page_erase((uint32_t)addr) != FMC_READY)
    {
      gd32_fmc_lock_ram();
      return -EIO;
    }

  /* FMC could have been left busy by a failed erase; never read flash then. */

  if ((getreg32(GD32_FMC_STAT) & FMC_STAT_BUSY) != 0)
    {
      gd32_fmc_lock_ram();
      return -EBUSY;
    }

  /* Spot-check only (full word rescan is unnecessary for OVERWRITE). */

  if (!progmem_page_erased_spot(addr))
    {
      gd32_fmc_lock_ram();
      return -EIO;
    }

  gd32_fmc_lock_ram();
  return (ssize_t)FMC_PROGMEM_PAGESIZE;
#else
  sector_info = gd32_fmc_sector_info_get(addr);
  if (sector_info.sector_name == FMC_WRONG_SECTOR_NAME)
    {
      return -EFAULT;
    }

  if (up_progmem_ispageerased(block) == 0)
    {
      return (ssize_t)up_progmem_pagesize(block);
    }

  gd32_fmc_unlock_ram();
  gd32_fmc_flag_clear_ram(FMC_STAT_END | FMC_STAT_OPERR | FMC_STAT_WPERR |
                          FMC_STAT_PGMERR | FMC_STAT_PGSERR | FMC_STAT_RDDERR);

  if (gd32_fmc_sector_erase(sector_info.sector_num))
    {
      gd32_fmc_lock_ram();
      return -EFAULT;
    }

  if (up_progmem_ispageerased(block) == 0)
    {
      gd32_fmc_lock_ram();
      return up_progmem_pagesize(block);
    }

  gd32_fmc_lock_ram();
  return -EIO;
#endif
}

/****************************************************************************
 * Name: up_progmem_ispageerased
 *
 * Description:
 *   Checks whether page is erased
 *
 * Input Parameters:
 *   page - The erase page index to be checked.
 *
 * Returned Value:
 *   Returns number of bytes NOT erased or negative value on error. If it
 *   returns zero then complete page is erased.
 *
 *   The following errors are reported:
 *     -EFAULT: On invalid page
 *
 ****************************************************************************/

ssize_t PROGMEM_RAMFUNC up_progmem_ispageerased(size_t page)
{
  size_t page_size;
  size_t addr;
  size_t i;

  if (page >= FMC_PROGMEM_SECTOR_NUM)
    {
      return -EFAULT;
    }

#ifdef FMC_PROGMEM_PAGESIZE
  page_size = FMC_PROGMEM_PAGESIZE;
  addr = FMC_PROGMEM_SECTOR_SADDR + page * FMC_PROGMEM_PAGESIZE;
#else
  page_size = up_progmem_pagesize(page);
  addr = up_progmem_getaddress(page);
#endif

  for (i = 0; i < page_size; i += 4)
    {
      if (*(volatile uint32_t *)(addr + i) != 0xffffffffu)
        {
          return (ssize_t)(page_size - i);
        }
    }

  return 0;
}

/****************************************************************************
 * Name: up_progmem_write
 *
 * Description:
 *   Program data at given address
 *
 *   Note: this function is not limited to single page and nor it requires
 *   the address be aligned inside the page boundaries.
 *
 * Input Parameters:
 *   addr  - Address with or without flash offset
 *           (absolute or aligned to page0)
 *   buf   - Pointer to buffer
 *   count - Number of bytes to write
 *
 * Returned Value:
 *   Bytes written or negative value on error.  The following errors are
 *   reported (errno is not set!)
 *
 *     EINVAL: If count is not aligned with the flash boundaries (i.e.
 *             some MCU's require per half-word or even word access)
 *     EFAULT: On invalid address
 *     EIO:    On unsuccessful write
 *     EROFS:  On access to write protected area
 *     EACCES: Insufficient permissions (read/write protected)
 *     EPERM:  If operation is not permitted due to some other constraints
 *             (i.e. some internal block is not running etc.)
 *
 ****************************************************************************/

/****************************************************************************
 * Name: progmem_write_ram
 *
 * Description:
 *   Program loop that must execute from RAM on GD32F470 (same flash bank as
 *   the loader/app). Flash-resident loops hang if they fetch while FMC BUSY.
 *
 ****************************************************************************/

static PROGMEM_RAMFUNC int progmem_write_ram(size_t addr, FAR const uint8_t *byte,
                                              size_t remaining)
{
  while (remaining > 0)
    {
      if ((addr & 3) == 0 && remaining >= 4)
        {
          uint32_t word =
            ((uint32_t)byte[0]) |
            ((uint32_t)byte[1] << 8) |
            ((uint32_t)byte[2] << 16) |
            ((uint32_t)byte[3] << 24);

          if (word != 0xffffffffu)
            {
              if (gd32_fmc_word_program(addr, word) != FMC_READY)
                {
                  return -EIO;
                }
            }

          addr += 4;
          byte += 4;
          remaining -= 4;
          continue;
        }

      if (*byte != 0xff)
        {
          if (gd32_fmc_byte_program(addr, *byte) != FMC_READY)
            {
              return -EIO;
            }
        }

      addr++;
      byte++;
      remaining--;
    }

  return OK;
}

/****************************************************************************
 * Name: up_progmem_write
 *
 * Description:
 *   Program data at given address
 *
 *   Note: this function is not limited to single page and nor it requires
 *   the address be aligned inside the page boundaries.
 *
 * Input Parameters:
 *   addr  - Address with or without flash offset
 *           (absolute or aligned to page0)
 *   buf   - Pointer to buffer
 *   count - Number of bytes to write
 *
 * Returned Value:
 *   Bytes written or negative value on error.  The following errors are
 *   reported (errno is not set!)
 *
 *     EINVAL: If count is not aligned with the flash boundaries (i.e.
 *             some MCU's require per half-word or even word access)
 *     EFAULT: On invalid address
 *     EIO:    On unsuccessful write
 *     EROFS:  On access to write protected area
 *     EACCES: Insufficient permissions (read/write protected)
 *     EPERM:  If operation is not permitted due to some other constraints
 *             (i.e. some internal block is not running etc.)
 *
 ****************************************************************************/

